In [1]:
import pandas as pd

# Reading employee and department datasets
employees_df = pd.read_csv('employees.csv')

departments_df = pd.read_csv('departments.csv')

Task 1: Join the Data

Merge the employees.csv and departments.csv datasets using the Department_ID column. Show the combined dataset.

In [2]:
# Merge the datasets using the 'Department_ID' column
merged_df = pd.merge(employees_df, departments_df, on='Department_ID')

merged_df

   Employee_ID     Name  Age Department_ID Department_Name       Location
0          101    Alice   30          D001           Sales       New York
1          103  Charlie   28          D001           Sales       New York
2          102      Bob   35          D002       Marketing         London
3          104    David   40          D003              IT  San Francisco
4          105      Eve   45          D004              HR      Singapore

Task 2: Filter the Data

From the merged dataset, extract a subset of employees who are older than 30 and work in New York or London.

In [3]:
# Filter employees who are older than 30 and work in New York or London
filtered_df = merged_df[(merged_df['Age'] > 30) & 
                        (merged_df['Location'].isin(['New York', 'London']))]

# Show the filtered dataset
print("\nFiltered Employees (Older than 30 and in New York or London):")
filtered_df

Filtered Employees (Older than 30 and in New York or London):

   Employee_ID Name  Age Department_ID Department_Name Location
2          102  Bob   35          D002       Marketing   London

Task 3: Reshape the Data (Pivoting)

Create a summary table that shows the count of employees in each department by location.

In [4]:
# Create a summary table that shows the count of employees in each department by location (Pivoting)
summary_table = pd.pivot_table(merged_df, values='Employee_ID', index='Department_Name', columns='Location', aggfunc='count', fill_value=0)

summary_table

Location         London  New York  San Francisco  Singapore
Department_Name
HR                    0         0              0          1
IT                    0         0              1          0
Marketing             1         0              0          0
Sales                 0         2              0          0

Task 4: Create a New Column

Add a new column to the combined dataset that categorizes employees into age groups:
"Young" if age < 35
"Mid-aged" if age is between 35 and 45
"Senior" if age > 45

In [5]:
# Add a new column categorizing employees by age groups
def categorize_age(age):
    if age < 35:
        return 'Young'
    elif 35 <= age <= 45:
        return 'Mid-aged'
    else:
        return 'Senior'

merged_df['Age_Group'] = merged_df['Age'].apply(categorize_age)

merged_df.head()

,Employee_ID,Name,Age,Department_ID,Department_Name,Location,Age_Group
0,101,Alice,30,D001,Sales,New York,Young
1,103,Charlie,28,D001,Sales,New York,Young
2,102,Bob,35,D002,Marketing,London,Mid-aged
3,104,David,40,D003,IT,San Francisco,Mid-aged
4,105,Eve,45,D004,HR,Singapore,Mid-aged

Task 5: Final Output

Save the final reshaped and categorized dataset to a CSV file.

In [6]:
# Save the final merged dataset with the Age_Group column to a CSV file
merged_df.to_csv('final_merged_dataset.csv', index=False)